CSI API ETABS v1
cLinkObj.Delete Method
 Deletes link objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Delete(
	string Name,
	eItemType ItemType = eItemType.Objects
)
Function Delete (
	Name As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.Delete(Name, ItemType)
int Delete(
	String^ Name,
	eItemType ItemType = eItemType::Objects
)
abstract Delete :
        Name : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object or group, depending on the value of the ItemType item.
ItemType (Optional)
Type: ETABSv1.eItemType
This is one of the items in the eItemType enumeration.
If this item is Objects, the link object specified by the Name item is deleted.
If this item is Group, the all link objects in the group specified by the Name item are deleted.
If this item is SelectedObjects, all selected link objects are deleted, and the Name item is ignored.
Return Value
Type: Int32
Returns zero if the link objects are successfully deleted; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name1 As String
       Dim Name2 As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("2", "4", Name1)
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name2)
   'delete link object
     ret = SapModel.LinkObj.Delete(Name1)
   'refresh view
       ret = SapModel.View.RefreshView
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace